primer/img/LegalBasis.dot
digraph G {
    rankdir=BT;
    compound=true;
    node [shape=rect,style=filled,fillcolor=yellow];
    edge [arrowhead=onormal];
    
    Thing [fillcolor=none];
    LegalBasis -> Thing [label="hasLegalBasis",arrowhead=none,dir=both,arrowtail=normal];
    Consent -> LegalBasis ;
    Contract -> LegalBasis ;
    DataTransferLegalBasis -> LegalBasis ;
    
    ContractPerformance -> Contract ;
    EnterIntoContract -> Contract ;
    LegalObligation -> LegalBasis ;
    LegitimateInterest -> LegalBasis ;
    LegitimateInterestOfController -> LegitimateInterest ;
    LegitimateInterestOfThirdParty -> LegitimateInterest ;
    OfficialAuthorityOfController -> LegalBasis ;
    PublicInterest -> LegalBasis ;
    VitalInterest -> LegalBasis ;
    VitalInterestOfDataSubject -> VitalInterest ;
    VitalInterestOfNaturalPerson -> VitalInterest ;
}
